Revit 2027 API
ParameterTypeId.SteelElemWeldMainEffectivethroat Property
 "Main Effective Throat"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemWeldMainEffectivethroat { get; }
Public Shared ReadOnly Property SteelElemWeldMainEffectivethroat As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemWeldMainEffectivethroat {
	ForgeTypeId^ get ();
}
static member SteelElemWeldMainEffectivethroat : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace